ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_usart.c
/*********************************************************************************************************//**
 * @file    ht32f7xxxx_usart.c
 * @version $Rev:: 259          $
 * @date    $Date:: 2025-06-11 #$
 * @brief   This file provides all the USART firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f7xxxx_usart.h"

/** @addtogroup HT32F7xxxx_Peripheral_Driver HT32F7xxxx Peripheral Driver
  * @{
  */

/** @defgroup USART USART
  * @brief USART driver modules
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup USART_Private_Define USART private definitions
  * @{
  */
#define CR_CLEAR_Mask             ((u32)0xFFFFE0FC)

#define USART_BREAK_ON            ((u32)0x00004000)
#define USART_BREAK_OFF           ((u32)0xFFFFBFFF)

#define USART_PBE_ON              ((u32)0x00000800)
#define USART_SPE_ON              ((u32)0x00002000)
#define USART_SPE_OFF             ((u32)0xFFFFDFFF)

#define USART_EN_ON               ((u32)0x00000010)

#define USART_HFCEN_ON            ((u32)0x00000008)
#define USART_HFCEN_OFF           ((u32)0xFFFFFFF7)

#define USART_RXTOEN_ON           ((u32)0x00000080)

#define FCR_TL_Mask               ((u32)0x00000030)

#define TRSM_CLEAR_Mask           ((u32)0xFFFFFFFB)
#define TPR_TG_Mask               ((u32)0xFFFF00FF)
#define ICR_IRDAPSC_Mask          ((u32)0xFFFF00FF)
#define TPR_RXTOIC_Mask           ((u32)0xFFFFFF80)
#define RS485CR_ADDM_Mask         ((u32)0xFFFF00FF)

#define USART_IRDA_ON             ((u32)0x00000001)
#define USART_IRDA_OFF            ((u32)0xFFFFFFFE)

#define USART_INV_ON              ((u32)0x00000010)

#define USART_RS485NMM_ON         ((u32)0x00000002)
#define USART_RS485NMM_OFF        ((u32)0xFFFFFFFD)

#define USART_RS485AAD_ON         ((u32)0x00000004)
#define USART_RS485AAD_OFF        ((u32)0xFFFFFFFB)
/**
  * @}
  */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup USART_Exported_Functions USART exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize the USART/UART peripheral registers to their default reset values.
 * @param USARTx: Parameter to select the UxART peripheral.
 * @retval None
 ************************************************************************************************************/
void USART_DeInit(HT_USART_TypeDef* USARTx)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};
  u32 uIPAddr = (u32)USARTx;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));

  switch (uIPAddr)
  {
    #if (!LIBCFG_NO_USART0)
    case HT_USART0_BASE:
    {
      RSTCUReset.Bit.USART0 = 1;
      break;
    }
    #endif
    #if (LIBCFG_USART1)
    case HT_USART1_BASE:
    {
      RSTCUReset.Bit.USART1 = 1;
      break;
    }
    #endif
    case HT_UART0_BASE:
    {
      RSTCUReset.Bit.UART0 = 1;
      break;
    }
    #if (LIBCFG_UART1)
    case HT_UART1_BASE:
    {
      RSTCUReset.Bit.UART1 = 1;
      break;
    }
    #endif
    #if (LIBCFG_UART2)
    case HT_UART2_BASE:
    {
      RSTCUReset.Bit.UART2 = 1;
      break;
    }
    #endif
    #if (LIBCFG_UART3)
    case HT_UART3_BASE:
    {
      RSTCUReset.Bit.UART3 = 1;
      break;
    }
    #endif
  }

  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Initialize the USART/UART peripheral according to the specified parameters in the USART_InitStruct.
 * @param USARTx: Parameter to select the UxART peripheral.
 * @param USART_InitStruct: pointer to a USART_InitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void USART_Init(HT_USART_TypeDef* USARTx, USART_InitTypeDef* USART_InitStruct)
{
  #if (HT32_LIB_LITE == 0)
  u32 uIPClock = 0;
  u32 uIPAddr = (u32)USARTx;
  #endif

  /* Check the parameters                                                                                   */
  Assert_Param(IS_USART(USARTx));
  Assert_Param(IS_USART_BAUDRATE(USART_InitStruct->USART_BaudRate));
  Assert_Param(IS_USART_WORD_LENGTH(USART_InitStruct->USART_WordLength));
  Assert_Param(IS_USART_STOPBITS(USART_InitStruct->USART_StopBits));
  Assert_Param(IS_USART_PARITY(USART_InitStruct->USART_Parity));
  Assert_Param(IS_USART_MODE(USART_InitStruct->USART_Mode));

  USARTx->CR = (USARTx->CR & CR_CLEAR_Mask) | USART_InitStruct->USART_StopBits |
                USART_InitStruct->USART_WordLength | USART_InitStruct->USART_Parity |
                USART_InitStruct->USART_Mode;

  #if (HT32_LIB_LITE == 0)
  switch (uIPAddr)
  {
    #if (!LIBCFG_NO_USART0)
    case HT_USART0_BASE:
    {
      uIPClock = CKCU_GetPeripFrequency(CKCU_PCLK_USART0);
      break;
    }
    #endif
    #if (LIBCFG_USART1)
    case HT_USART1_BASE:
    {
      uIPClock = CKCU_GetPeripFrequency(CKCU_PCLK_USART1);
      break;
    }
    #endif
    case HT_UART0_BASE:
    {
      uIPClock = CKCU_GetPeripFrequency(CKCU_PCLK_UART0);
      break;
    }
    #if (LIBCFG_UART1)
    case HT_UART1_BASE:
    {
      uIPClock = CKCU_GetPeripFrequency(CKCU_PCLK_UART1);
      break;
    }
    #endif
    #if (LIBCFG_UART2)
    case HT_UART2_BASE:
    {
      uIPClock = CKCU_GetPeripFrequency(CKCU_PCLK_UART2);
      break;
    }
    #endif
    #if (LIBCFG_UART3)
    case HT_UART3_BASE:
    {
      uIPClock = CKCU_GetPeripFrequency(CKCU_PCLK_UART3);
      break;
    }
    #endif
  }

  USARTx->DLR = uIPClock / (u32)USART_InitStruct->USART_BaudRate;
  #else
  USARTx->DLR = USART_InitStruct->USART_BaudRateReg;
  #endif
}

